/**
 * 订单状态： 1-待支付、2-待发货、3-待收货、4-已签收、5-待核销、6-已核销、7-交易完成、8-交易关闭、
 * 9-已过期、12-支付中、14-退款中、15-已退款、16-退货退款、20-部分退款、21-部分退货退款
 */
export const ORDER_STATUS_MAP = {
  0: "删除",
  1: "待付款",
  2: "待发货",
  3: "待收货",
  4: "已签收",
  5: "待核销",
  6: "已核销",
  7: "已完成",
  8: "已取消",
  9: "已过期",
  10: "预售单尾款待支付",
  11: "自提订单待自提",
  12: "支付中",
  13: "订金已支付",
  14: "退款中",
  15: "已退款",
  16: "退货退款",
  17: "已退订金",
  18: "订金支付中",
  19: "支付失败",
  20: "部分退款",
  21: "部分退货退款",
  22: "待配送",
};
/**
 * 销售订单类型枚举
 */
export const SALE_ORDER_TYPE_ENUM = {
  "020": "商城实物订单", // 门店达达订单
  "021": "商城服务订单", //
  "030": "医疗问诊单",
  "031": "喂食订单",
  "035": "高价值活体订单", // 宠物购买订单
  "036": "低价值活体订单",
  100: "预约美洗单",
  101: "预约看宠单",
  102: "处方药品订单",
  103: "胖豆兑换订单",
};

/**
 * appId
 */
export const appId = "1729776648698531840";
/**
 * 门店达达订单标签
 */
export const DELIVERY_STATUS_MAP = {
  "-1": "待付款",
  "-5": "待派单",
  "-7": "门店备货中",
  "-8": "待派单",
  1: "正在召唤骑手",
  "-10": "正在召唤骑手",
  "-20": "已取消派单",
  "-30": "已取消派单",
  "-40": "已取消派单",
  5: "正在召唤骑手",
  10: "骑手已接单",
  20: "骑手已到店",
  30: "骑手送货中",
  40: "交易完成",
  "-50": "派送异常，物品返回中",
  "-60": "派送异常，物品返回中",
};
/**
 * 付费问诊订单标签
 */
export const INQUIRY_STATUS_MAP = {
  AI_INQUIRY: "智能问诊",
  QUICK: "宠医义诊",
  EXPERT: "专家问诊",
  ONLINE_PRESCRIPTION: "在线开药",
  REPORT_INTERPRETATION: "报告解读",
  NUTRITION: "营养咨询",
};

/**
 * 订单固定名称
 */
export const OEDER_NAME_MAP = {
  "030": "付费问诊",
  "031": "投喂",
  "103": "胖豆",
};
/**
 * 订单展示icon
 */
export const OEDER_ICON_MAP = {
  "020": "icon-yunchao", // 门店达达订单
  "021": "icon-yunchao", //
  "030": "icon-wenzhen1",
  "031": "icon-touwei",
  "035": "icon-store", // 宠物购买订单
  "036": "icon-store",
  "100": "icon-store",
  "101": "icon-store",
  "102": "",
  "103": "icon-pangdou",
};
